---
kind: property
id: P:Autodesk.Revit.UI.ButtonData.Text
source: html/292dafb4-e985-a867-6ae5-0473322925e9.htm
---
# Autodesk.Revit.UI.ButtonData.Text Property

The user-visible text of the button.

## Syntax (C#)
```csharp
public string Text { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when setting the value to Nothing nullptr a null reference ( Nothing in Visual Basic) .
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when setting the value to an empty string,
or when the value contains invalid characters.